bench/results/100000_db.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/rank_ab.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m5s max duration (incl. graceful stop):
              * rank_ab: 30 looping VUs for 1m0s (gracefulStop: 5s)


running (0m01.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
rank_ab   [   2% ] 30 VUs  0m01.0s/1m0s

running (0m02.0s), 30/30 VUs, 3 complete and 0 interrupted iterations
rank_ab   [   3% ] 30 VUs  0m02.0s/1m0s

running (0m03.0s), 30/30 VUs, 8 complete and 0 interrupted iterations
rank_ab   [   5% ] 30 VUs  0m03.0s/1m0s

running (0m04.0s), 30/30 VUs, 10 complete and 0 interrupted iterations
rank_ab   [   7% ] 30 VUs  0m04.0s/1m0s

running (0m11.4s), 30/30 VUs, 10 complete and 0 interrupted iterations
rank_ab   [   9% ] 30 VUs  0m05.1s/1m0s

running (0m12.3s), 30/30 VUs, 18 complete and 0 interrupted iterations
rank_ab   [  10% ] 30 VUs  0m06.0s/1m0s

running (0m13.3s), 30/30 VUs, 23 complete and 0 interrupted iterations
rank_ab   [  12% ] 30 VUs  0m07.0s/1m0s

running (0m14.3s), 30/30 VUs, 29 complete and 0 interrupted iterations
rank_ab   [  13% ] 30 VUs  0m08.0s/1m0s

running (0m15.3s), 30/30 VUs, 39 complete and 0 interrupted iterations
rank_ab   [  15% ] 30 VUs  0m09.0s/1m0s

running (0m16.3s), 30/30 VUs, 48 complete and 0 interrupted iterations
rank_ab   [  17% ] 30 VUs  0m10.0s/1m0s

running (0m17.3s), 30/30 VUs, 55 complete and 0 interrupted iterations
rank_ab   [  18% ] 30 VUs  0m11.0s/1m0s

running (0m18.3s), 30/30 VUs, 60 complete and 0 interrupted iterations
rank_ab   [  20% ] 30 VUs  0m12.0s/1m0s

running (0m19.3s), 30/30 VUs, 70 complete and 0 interrupted iterations
rank_ab   [  22% ] 30 VUs  0m13.0s/1m0s

running (0m20.3s), 30/30 VUs, 75 complete and 0 interrupted iterations
rank_ab   [  23% ] 30 VUs  0m14.0s/1m0s

running (0m21.3s), 30/30 VUs, 83 complete and 0 interrupted iterations
rank_ab   [  25% ] 30 VUs  0m15.0s/1m0s

running (0m22.3s), 30/30 VUs, 89 complete and 0 interrupted iterations
rank_ab   [  27% ] 30 VUs  0m16.0s/1m0s

running (0m23.3s), 30/30 VUs, 95 complete and 0 interrupted iterations
rank_ab   [  28% ] 30 VUs  0m17.0s/1m0s

running (0m24.3s), 30/30 VUs, 103 complete and 0 interrupted iterations
rank_ab   [  30% ] 30 VUs  0m18.0s/1m0s

running (0m25.3s), 30/30 VUs, 109 complete and 0 interrupted iterations
rank_ab   [  32% ] 30 VUs  0m19.0s/1m0s

running (0m26.3s), 30/30 VUs, 115 complete and 0 interrupted iterations
rank_ab   [  33% ] 30 VUs  0m20.0s/1m0s

running (0m27.3s), 30/30 VUs, 122 complete and 0 interrupted iterations
rank_ab   [  35% ] 30 VUs  0m21.0s/1m0s

running (0m28.3s), 30/30 VUs, 129 complete and 0 interrupted iterations
rank_ab   [  37% ] 30 VUs  0m22.0s/1m0s

running (0m29.3s), 30/30 VUs, 135 complete and 0 interrupted iterations
rank_ab   [  38% ] 30 VUs  0m23.0s/1m0s

running (0m30.3s), 30/30 VUs, 147 complete and 0 interrupted iterations
rank_ab   [  40% ] 30 VUs  0m24.0s/1m0s

running (0m31.3s), 30/30 VUs, 149 complete and 0 interrupted iterations
rank_ab   [  42% ] 30 VUs  0m25.0s/1m0s

running (0m32.3s), 30/30 VUs, 155 complete and 0 interrupted iterations
rank_ab   [  43% ] 30 VUs  0m26.0s/1m0s

running (0m33.3s), 30/30 VUs, 165 complete and 0 interrupted iterations
rank_ab   [  45% ] 30 VUs  0m27.0s/1m0s

running (0m34.3s), 30/30 VUs, 169 complete and 0 interrupted iterations
rank_ab   [  47% ] 30 VUs  0m28.0s/1m0s

running (0m35.3s), 30/30 VUs, 178 complete and 0 interrupted iterations
rank_ab   [  48% ] 30 VUs  0m29.0s/1m0s

running (0m36.3s), 30/30 VUs, 185 complete and 0 interrupted iterations
rank_ab   [  50% ] 30 VUs  0m30.0s/1m0s

running (0m37.3s), 30/30 VUs, 185 complete and 0 interrupted iterations
rank_ab   [  52% ] 30 VUs  0m31.0s/1m0s

running (0m38.3s), 30/30 VUs, 198 complete and 0 interrupted iterations
rank_ab   [  53% ] 30 VUs  0m32.0s/1m0s

running (0m39.3s), 30/30 VUs, 205 complete and 0 interrupted iterations
rank_ab   [  55% ] 30 VUs  0m33.0s/1m0s

running (0m40.3s), 30/30 VUs, 205 complete and 0 interrupted iterations
rank_ab   [  57% ] 30 VUs  0m34.0s/1m0s

running (0m41.3s), 30/30 VUs, 220 complete and 0 interrupted iterations
rank_ab   [  58% ] 30 VUs  0m35.0s/1m0s

running (0m42.3s), 30/30 VUs, 225 complete and 0 interrupted iterations
rank_ab   [  60% ] 30 VUs  0m36.0s/1m0s

running (0m43.3s), 30/30 VUs, 227 complete and 0 interrupted iterations
rank_ab   [  62% ] 30 VUs  0m37.0s/1m0s

running (0m44.3s), 30/30 VUs, 244 complete and 0 interrupted iterations
rank_ab   [  63% ] 30 VUs  0m38.0s/1m0s

running (0m45.3s), 30/30 VUs, 244 complete and 0 interrupted iterations
rank_ab   [  65% ] 30 VUs  0m39.0s/1m0s

running (0m46.3s), 30/30 VUs, 254 complete and 0 interrupted iterations
rank_ab   [  67% ] 30 VUs  0m40.0s/1m0s

running (0m47.3s), 30/30 VUs, 262 complete and 0 interrupted iterations
rank_ab   [  68% ] 30 VUs  0m41.0s/1m0s

running (0m48.3s), 30/30 VUs, 265 complete and 0 interrupted iterations
rank_ab   [  70% ] 30 VUs  0m42.0s/1m0s

running (0m49.3s), 30/30 VUs, 274 complete and 0 interrupted iterations
rank_ab   [  72% ] 30 VUs  0m43.0s/1m0s

running (0m50.3s), 30/30 VUs, 283 complete and 0 interrupted iterations
rank_ab   [  73% ] 30 VUs  0m44.0s/1m0s

running (0m51.3s), 30/30 VUs, 285 complete and 0 interrupted iterations
rank_ab   [  75% ] 30 VUs  0m45.0s/1m0s

running (0m52.3s), 30/30 VUs, 295 complete and 0 interrupted iterations
rank_ab   [  77% ] 30 VUs  0m46.0s/1m0s

running (0m53.3s), 30/30 VUs, 303 complete and 0 interrupted iterations
rank_ab   [  78% ] 30 VUs  0m47.0s/1m0s

running (0m54.3s), 30/30 VUs, 309 complete and 0 interrupted iterations
rank_ab   [  80% ] 30 VUs  0m48.0s/1m0s

running (0m55.3s), 30/30 VUs, 316 complete and 0 interrupted iterations
rank_ab   [  82% ] 30 VUs  0m49.0s/1m0s

running (0m56.3s), 30/30 VUs, 323 complete and 0 interrupted iterations
rank_ab   [  83% ] 30 VUs  0m50.0s/1m0s

running (0m57.3s), 30/30 VUs, 330 complete and 0 interrupted iterations
rank_ab   [  85% ] 30 VUs  0m51.0s/1m0s

running (0m58.3s), 30/30 VUs, 339 complete and 0 interrupted iterations
rank_ab   [  87% ] 30 VUs  0m52.0s/1m0s

running (0m59.3s), 30/30 VUs, 343 complete and 0 interrupted iterations
rank_ab   [  88% ] 30 VUs  0m53.0s/1m0s

running (1m00.3s), 30/30 VUs, 352 complete and 0 interrupted iterations
rank_ab   [  90% ] 30 VUs  0m54.0s/1m0s

running (1m01.3s), 30/30 VUs, 360 complete and 0 interrupted iterations
rank_ab   [  92% ] 30 VUs  0m55.0s/1m0s

running (1m02.3s), 30/30 VUs, 365 complete and 0 interrupted iterations
rank_ab   [  93% ] 30 VUs  0m56.0s/1m0s

running (1m03.3s), 30/30 VUs, 371 complete and 0 interrupted iterations
rank_ab   [  95% ] 30 VUs  0m57.0s/1m0s

running (1m04.3s), 30/30 VUs, 377 complete and 0 interrupted iterations
rank_ab   [  97% ] 30 VUs  0m58.0s/1m0s

running (1m05.3s), 30/30 VUs, 384 complete and 0 interrupted iterations
rank_ab   [  98% ] 30 VUs  0m59.0s/1m0s

running (1m06.3s), 30/30 VUs, 392 complete and 0 interrupted iterations
rank_ab   [ 100% ] 30 VUs  1m00.0s/1m0s

running (1m07.3s), 23/30 VUs, 399 complete and 0 interrupted iterations
rank_ab ↓ [ 100% ] 30 VUs  1m0s

running (1m08.3s), 16/30 VUs, 406 complete and 0 interrupted iterations
rank_ab ↓ [ 100% ] 30 VUs  1m0s

running (1m09.3s), 04/30 VUs, 418 complete and 0 interrupted iterations
rank_ab ↓ [ 100% ] 30 VUs  1m0s


  █ TOTAL RESULTS 

    checks_total.......: 422    6.06317/s
    checks_succeeded...: 97.15% 410 out of 422
    checks_failed......: 2.84%  12 out of 422

    ✗ top30 200
      ↳  97% — ✓ 292 / ✗ 6
    ✗ user_rank 200
      ↳  95% — ✓ 118 / ✗ 6

    CUSTOM
    top30_latency..................: avg=4.52s min=1.94s med=4.21s max=14.41s p(90)=5.3s  p(95)=9.36s 
    user_rank_latency..............: avg=5.62s min=3.06s med=4.8s  max=15.27s p(90)=9.79s p(95)=14.73s

    HTTP
    http_req_duration..............: avg=4.85s min=1.94s med=4.33s max=15.27s p(90)=5.72s p(95)=10.11s
      { expected_response:true }...: avg=4.73s min=1.94s med=4.32s max=15.27s p(90)=5.51s p(95)=6.06s 
    http_req_failed................: 2.84%  12 out of 422
    http_reqs......................: 422    6.06317/s

    EXECUTION
    iteration_duration.............: avg=4.4s  min=1.94s med=4.28s max=9.01s  p(90)=5.48s p(95)=6.02s 
    iterations.....................: 422    6.06317/s
    vus............................: 4      min=4         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 518 kB 7.4 kB/s
    data_sent......................: 34 kB  482 B/s



running (1m09.6s), 00/30 VUs, 422 complete and 0 interrupted iterations
rank_ab ✓ [ 100% ] 30 VUs  1m0s